#ifndef FANCY_CALCULATOR_TABLE_OF_RANKS_H
#define FANCY_CALCULATOR_TABLE_OF_RANKS_H
#include <map>
#include <string>

inline std::map<size_t, std::string> table = {
    {1, "Канцълер"}, //germanic influence still exists
    {2, "Дѣйствительный тайный совѣтникъ"},
    {3, "Тайный совѣтникъ"},
    {4, "Дѣйствительный статскій совѣтникъ"},
    {5, "Статскій совѣтникъ"},
    {6, "Коллежскій  совѣтникъ"},
    {7, "Надворный совѣтникъ"},
    {8, "Коллежскій асессоръ"},
    {9, "Титулярный совѣтникъ"},
    {10, "Коллежскій секретарь"},
    {11, "Корабельный секретарь"},
    {12, "Губернский секретарь"},
    {13, "Кабинетский регистраторъ"},
    {14, "Коллежскій регистраторъ"},
    {15, "Сожалѣю, вы вне табели о рангахъ"}
};

#endif //FANCY_CALCULATOR_TABLE_OF_RANKS_H